tap "homebrew/bundle"
tap "d12frosted/emacs-plus"

# Essential tools for any development environment
brew "git"
brew "gh"
brew "fzf"
brew "ripgrep"
brew "bat"
brew "eza"
brew "fd"
brew "jq"
brew "tmux"
brew "htop"
brew "tree"
brew "watch"
brew "neovim"

# Text editing and spell checking
brew "aspell"
brew "d12frosted/emacs-plus/emacs-plus@31"

# Development environment management
brew "asdf"
brew "pnpm"

# Cloud and infrastructure tools
brew "awscli"
brew "duckdb"

# Casks
cask "gcloud-cli"
cask "orbstack"